package ru.gb.krasnoperov.homework3s1n;

//         * 1. Написать метод, который меняет два элемента массива местами (массив может быть любого
//         * ссылочного типа);
//         * static swap(array1, int firstIndex, int secondIndex) {
//         *     // меняем местами элементы, которые находятся на местах firstIndex и secondIndex
//         * }
//         *
//         * 2. Написать метод, который преобразует массив в ArrayList;
//         *
//         * 3. Задача:
//         * a. Даны классы abstract Fruit, Apple extends Fruit, Orange extends Fruit;
//         * b. Класс Box, в который можно складывать фрукты. Коробки условно сортируются по типу
//         * фрукта, поэтому в одну коробку нельзя сложить и яблоки, и апельсины;
//         * c. Для хранения фруктов внутри коробки можно использовать ArrayList;
//         * d. Сделать в классе Box метод getWeight(), который высчитывает вес коробки по содержимому:
//         *          вес яблока – 1.0f, апельсина – 1.5f (единицы измерения не важны);
//         * e. Внутри класса Box сделать метод compare(), который позволяет сравнить текущую
//         * коробку с той, которую подадут в compare() в качестве параметра. true – если их массы
//         * равны, false в противоположном случае. Можно сравнивать коробки с яблоками и
//         * апельсинами;
//         * f. Написать метод, который позволяет пересыпать фрукты из текущей коробки в другую.
//         * Помним про сортировку фруктов: нельзя яблоки высыпать в коробку с апельсинами.
//         * Соответственно, в текущей коробке фруктов не остается, а в другую перекидываются
//         * объекты, которые были в первой;
//         * f*. Для усложнения, создать класс GoldenApple extends Apple
//         * g. Не забываем про метод добавления фрукта в коробку.
//         * g*. Метод из g должен принимать varargs: ...


public class HomeWork {

    public static void main(String[] args) {

    }

}
